---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexStream
source: html/b61ecf03-275e-e18a-88e8-0e4c2e594ad0.htm
---
# IndexStream Properties

Specifies whether the .NET object represents a valid Revit entity.